import random

class student_name():
    def surname(self):#生成姓
        surname_a = ['赵','钱','孙','李','韩','陈','程','周','吴','郑','王','冯','卫','蒋','沈','杨','朱','秦',
                     '许','何','吕','张','孔','曹','严','金','魏','陶','姜','谢','章','云','苏','窦','潘','刘',
                     '袁','任','贺','胡','彭','汤','唐','柳','伍','齐','康','黄','汪','萧','宋','屈','毛','卢',
                     '樊','田','钟','徐','邱','万','林','丁','邓','高','江','段','曲','叶','赖','谭','宁','燕',
                     '庄','易','古','容', '阎','温','欧阳','公孙','阳','轩辕','司徒','诸葛','宇文','慕容','上官']
        return random.choice(surname_a)
    def surname_name(self):#生成名
        surname_name_a = ['婧文','立民','卫国','依萱','坤','伟','萌','一唯','丽红','成祥','辉煌','展翔','展翅',
                          '泽西','韵澄','文贤','丽清','静','学豪','博文','琳','宇','涛','轩海','雪凡','春燕',
                          '泉','玉萍','若兰','慧丽','腾','本山','馨','希远','玉芝','琳琳','梦琪','杰','馨怡',
                          '紫萱','智雅','忠泽','亚','莹','浩','华生','天云','金波','烨','策','萌','娟','超',
                          '亮','怀文','可','哲','逸轩','克','心云','然','洁','丽娜','云鹏','鑫','平','晶','威',
                          '铭','宁','令江','国平','炎','子文','陨','茜','峥','祥颖','倾','岳','延军','帆','晨',
                          '均','锦','升宇','度','瑞','若男','阳']
        return random.choice(surname_name_a)
    def name(self):#组合姓和名
        name = self.surname()+self.surname_name()
        return name
    def name_number(self,list,num):#用列表装生成的姓名
        for i in range(0,num):
            name = self.name()
            list.append(name)

student_name().name()

